# Exercise 4.9 Task 1

In [1]:
# import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# import customers table
df_cust = pd.read_csv(r'C:\Users\kacie\Box\Personal\CareerFoundry\Data Immersion\Achievement 4\Jupyter Folders\Data\Original Data\customers.csv')

In [3]:
# check table shape
df_cust.shape

(206209, 10)

In [4]:
# check table 
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Wrangling customer table

In [5]:
# rename Surname column
df_cust.rename(columns = {'Surnam':'Last Name'}, inplace = True)

In [6]:
# check customer table
df_cust.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
# check customer data types
df_cust.dtypes

user_id          int64
First Name      object
Last Name       object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [8]:
# Find customer table statistics
df_cust.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [9]:
# change data types 
df_cust = df_cust.astype({'user_id': 'int32', 'Age':'int8', 'n_dependants': 'int8', 'income': 'int32'})

In [10]:
# check customer table
df_cust.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [11]:
# change data type for date joined to datetime
df_cust['date_joined'] = pd.to_datetime(df_cust['date_joined'])

## Customer table consistency check

In [12]:
# check data types for customer table
df_cust.dtypes

user_id                  int32
First Name              object
Last Name               object
Gender                  object
STATE                   object
Age                       int8
date_joined     datetime64[ns]
n_dependants              int8
fam_status              object
income                   int32
dtype: object

In [13]:
# check for mixed data types in customer table
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First Name

In [14]:
# change data type of First Name column
df_cust['First Name'] = df_cust['First Name'].astype('str')

In [15]:
# check data type of First Name column 
df_cust['First Name'].dtype

dtype('O')

In [16]:
# check for mixed data types 
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [17]:
# Check for missing values 
df_cust.isnull().sum()

user_id         0
First Name      0
Last Name       0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [18]:
# check for duplicated rows
df_cust.duplicated().sum()

0

## Merge the ord_prod and customer tables

In [19]:
# load the ord_prod table
ord_prod = pd.read_pickle(r'C:\Users\kacie\Box\Personal\CareerFoundry\Data Immersion\Achievement 4\Jupyter Folders\Data\Prepared Data\ord_prod_frequency.pkl')

In [20]:
# find the columns of the ord_prod table
ord_prod.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', '_merge', 'price_range_loc', 'Busiest_Days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'spending_mean',
       'spending_flag', 'frequency_median', 'frequency_flag'],
      dtype='object')

In [21]:
# find the columns of the customer table
df_cust.columns

Index(['user_id', 'First Name', 'Last Name', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

In [22]:
# check data type of user_id column in ord_prod table
ord_prod['user_id'].dtype

dtype('int32')

In [23]:
# check data type of user_id column in customer table
df_cust['user_id'].dtype

dtype('int32')

In [24]:
# remove the _merge column from the ord_prod table
ord_prod.drop(['_merge'], axis = 1, inplace = True)

In [25]:
# list the columns of the ord_prod table
ord_prod.columns

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour', 'days_since_prior_order', 'product_id',
       'add_to_cart_order', 'reordered', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'Busiest_Days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'spending_mean',
       'spending_flag', 'frequency_median', 'frequency_flag'],
      dtype='object')

In [26]:
# merge the customer and ord_prod table
df_merge = ord_prod.merge(df_cust, on = 'user_id', indicator = True)

In [28]:
# check for full merge of tables
df_merge['_merge'].value_counts()

_merge
both          32435059
left_only            0
right_only           0
Name: count, dtype: int64

In [30]:
# remove the _merge column from the merged table
df_merge.drop(['_merge'], axis=1, inplace=True)

In [31]:
# change data type to category for Gender column
df_merge['Gender'] = df_merge['Gender'].astype('category')

In [32]:
# change data type to category for family status column
df_merge['fam_status'] = df_merge['fam_status'].astype('category')

In [33]:
# change data type to category for State column
df_merge['STATE'] = df_merge['STATE'].astype('category')

In [34]:
# check table
df_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,First Name,Last Name,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,65,1,1,2,8,0,196,1,0,Soda,...,Regular Customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
1,65,1,1,2,8,0,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Regular Customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
2,65,1,1,2,8,0,12427,3,0,Original Beef Jerky,...,Regular Customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
3,65,1,1,2,8,0,26088,4,0,Aged White Cheddar Popcorn,...,Regular Customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423
4,65,1,1,2,8,0,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Regular Customer,Linda,Nguyen,Female,Alabama,31,2019-02-17,3,married,40423

In [35]:
# check table shape
df_merge.shape

(32435059, 31)

In [36]:
df_merge.to_pickle(r'C:\Users\kacie\Box\Personal\CareerFoundry\Data Immersion\Achievement 4\Jupyter Folders\Data\Prepared Data\ord_prod_custB.pkl')